espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20648/src/sl_icm20648.c
  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Enables or disables the sleep mode of the device
 ******************************************************************************/
sl_status_t sl_icm20648_enable_sleep_mode(bool enable)
{
  uint8_t reg;

  sl_icm20648_read_register(ICM20648_REG_PWR_MGMT_1, 1, &reg);

  if ( enable ) {
    /* Sleep: set the SLEEP bit */
    reg |= ICM20648_BIT_SLEEP;
  } else {
    /* Wake up: clear the SLEEP bit */
    reg &= ~(ICM20648_BIT_SLEEP);
  }

  sl_icm20648_write_register(ICM20648_REG_PWR_MGMT_1, reg);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Enables or disables the cycle mode operation of the accel and gyro
 ******************************************************************************/
sl_status_t sl_icm20648_enable_cycle_mode(bool enable)
{
  uint8_t reg;

  reg = 0x00;

  if ( enable ) {
    reg = ICM20648_BIT_ACCEL_CYCLE | ICM20648_BIT_GYRO_CYCLE;
  }

  sl_icm20648_write_register(ICM20648_REG_LP_CONFIG, reg);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Enables or disables the sensors in the ICM20648 chip

 ******************************************************************************/
sl_status_t sl_icm20648_enable_sensor(bool accel, bool gyro, bool temp)
{
  uint8_t pwrManagement1;
  uint8_t pwrManagement2;

  sl_icm20648_read_register(ICM20648_REG_PWR_MGMT_1, 1, &pwrManagement1);
  pwrManagement2 = 0;

  /* To enable the accelerometer clear the DISABLE_ACCEL bits in PWR_MGMT_2 */
  if ( accel ) {
    pwrManagement2 &= ~(ICM20648_BIT_PWR_ACCEL_STBY);
  } else {
    pwrManagement2 |= ICM20648_BIT_PWR_ACCEL_STBY;
  }

  /* To enable gyro clear the DISABLE_GYRO bits in PWR_MGMT_2 */
  if ( gyro ) {
    pwrManagement2 &= ~(ICM20648_BIT_PWR_GYRO_STBY);
  } else {
    pwrManagement2 |= ICM20648_BIT_PWR_GYRO_STBY;
  }

  /* To enable the temperature sensor clear the TEMP_DIS bit in PWR_MGMT_1 */
  if ( temp ) {
    pwrManagement1 &= ~(ICM20648_BIT_TEMP_DIS);
  } else {
    pwrManagement1 |= ICM20648_BIT_TEMP_DIS;
  }

  /* Write back the modified values */
  sl_icm20648_write_register(ICM20648_REG_PWR_MGMT_1, pwrManagement1);
  sl_icm20648_write_register(ICM20648_REG_PWR_MGMT_2, pwrManagement2);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Enables or disables the sensors in low power mode in the ICM20648 chip
 ******************************************************************************/
sl_status_t sl_icm20648_enter_low_power_mode(bool enAccel, bool enGyro, bool enTemp)
{
  uint8_t data;

  sl_icm20648_read_register(ICM20648_REG_PWR_MGMT_1, 1, &data);

  if ( enAccel || enGyro || enTemp ) {
    /* Make sure that the chip is not in sleep */
    sl_icm20648_enable_sleep_mode(false);

    /* And in continuous mode */
    sl_icm20648_enable_cycle_mode(false);

    /* Enable the accelerometer and the gyroscope*/
    sl_icm20648_enable_sensor(enAccel, enGyro, enTemp);
    sl_sleeptimer_delay_millisecond(50);

    /* Enable cycle mode */
    sl_icm20648_enable_cycle_mode(true);

    /* Set the LP_EN bit to enable low power mode */
    data |= ICM20648_BIT_LP_EN;
  } else {
    /* Enable continuous mode */
    sl_icm20648_enable_cycle_mode(false);

    /* Clear the LP_EN bit to disable low power mode */
    data &= ~ICM20648_BIT_LP_EN;
  }

  /* Write the updated value to the PWR_MGNT_1 register */
  sl_icm20648_write_register(ICM20648_REG_PWR_MGMT_1, data);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Enables or disables the interrupts in the ICM20648 chip
 ******************************************************************************/
sl_status_t sl_icm20648_enable_interrupt(bool dataReadyEnable, bool womEnable)
{
  uint8_t intEnable;

  /* All interrupts disabled by default */
  intEnable = 0;

  /* Enable one or both of the interrupt sources if required */
  if ( womEnable ) {
    intEnable = ICM20648_BIT_WOM_INT_EN;
  }
  /* Write value to register */
  sl_icm20648_write_register(ICM20648_REG_INT_ENABLE, intEnable);

  /* All interrupts disabled by default */
  intEnable = 0;

  if ( dataReadyEnable ) {
    intEnable = ICM20648_BIT_RAW_DATA_0_RDY_EN;
  }

  /* Write value to register */
  sl_icm20648_write_register(ICM20648_REG_INT_ENABLE_1, intEnable);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Reads the interrupt status registers of the ICM20648 chip
 ******************************************************************************/
sl_status_t sl_icm20648_read_interrupt_status(uint32_t *intStatus)
{
  uint8_t reg[4];

  sl_icm20648_read_register(ICM20648_REG_INT_STATUS, 4, reg);
  *intStatus = (uint32_t) reg[0];
  *intStatus |= ( ( (uint32_t) reg[1]) << 8);
  *intStatus |= ( ( (uint32_t) reg[2]) << 16);
  *intStatus |= ( ( (uint32_t) reg[3]) << 24);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Checks if new data is available for read
 ******************************************************************************/
bool sl_icm20648_is_data_ready(void)
{
  uint8_t status;
  bool ret;

  ret = false;
  sl_icm20648_read_register(ICM20648_REG_INT_STATUS_1, 1, &status);

  if ( status & ICM20648_BIT_RAW_DATA_0_RDY_INT ) {
    ret = true;
  }

  return ret;
}

/***************************************************************************//**
 *    Sets up and enables the Wake-up On Motion feature
 ******************************************************************************/
sl_status_t sl_icm20648_enable_wake_on_motion_interrupt(bool enable, uint8_t womThreshold, float sampleRate)
{
  if ( enable ) {
    /* Make sure that the chip is not in sleep */
    sl_icm20648_enable_sleep_mode(false);

    /* And in continuous mode */
    sl_icm20648_enable_cycle_mode(false);

    /* Enable only the accelerometer */
    sl_icm20648_enable_sensor(true, false, false);

    /* Set sample rate */
    sl_icm20648_set_sample_rate(sampleRate);

