espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/icm20648/src/sl_icm20648.c
  /* Store them in the accelerometer offset registers */
  sl_icm20648_write_register(ICM20648_REG_XA_OFFSET_H, data[0]);
  sl_icm20648_write_register(ICM20648_REG_XA_OFFSET_L, data[1]);
  sl_icm20648_write_register(ICM20648_REG_YA_OFFSET_H, data[2]);
  sl_icm20648_write_register(ICM20648_REG_YA_OFFSET_L, data[3]);
  sl_icm20648_write_register(ICM20648_REG_ZA_OFFSET_H, data[4]);
  sl_icm20648_write_register(ICM20648_REG_ZA_OFFSET_L, data[5]);

  /* Convert the values to G for displaying */
  accelBiasScaled[0] = (float) accelBias[0] * accelRes;
  accelBiasScaled[1] = (float) accelBias[1] * accelRes;
  accelBiasScaled[2] = (float) accelBias[2] * accelRes;

  /* Turn off FIFO */
  sl_icm20648_write_register(ICM20648_REG_USER_CTRL, 0x00);

  /* Disable all sensors */
  sl_icm20648_enable_sensor(false, false, false);

  return SL_STATUS_OK;
}

/***************************************************************************//**
 *    Gyroscope calibration function. Reads the gyroscope
 *    values while the device is at rest and in level. The
 *    resulting values are loaded to the gyro bias registers to cancel
 *    the static offset error.
 ******************************************************************************/
sl_status_t sl_icm20648_calibrate_gyro(float *gyroBiasScaled)
{
  uint8_t data[12];
  uint16_t i, packetCount, fifoCount;
  int32_t gyroBias[3] = { 0, 0, 0 };
  int32_t gyroTemp[3];
  int32_t gyroBiasStored[3];
  float gyroRes;

  /* Enable the accelerometer and the gyro */
  sl_icm20648_enable_sensor(true, true, false);

  /* Set 1kHz sample rate */
  sl_icm20648_set_sample_rate(1100.0);

  /* Configure bandwidth for gyroscope to 12Hz */
  sl_icm20648_gyro_set_bandwidth(ICM20648_GYRO_BW_12HZ);

  /* Configure sensitivity to 250dps full scale */
  sl_icm20648_gyro_set_full_scale(ICM20648_GYRO_FULLSCALE_250DPS);

  /* Retrieve the resolution per bit */
  sl_icm20648_gyro_get_resolution(&gyroRes);

  /* The accel sensor needs max 30ms, the gyro max 35ms to fully start */
  /* Experiments show that the gyro needs more time to get reliable results */
  sl_sleeptimer_delay_millisecond(50);

  /* Disable the FIFO */
  sl_icm20648_write_register(ICM20648_REG_USER_CTRL, ICM20648_BIT_FIFO_EN);
  sl_icm20648_write_register(ICM20648_REG_FIFO_MODE, 0x0F);

  /* Enable accelerometer and gyro to store the data in FIFO */
  sl_icm20648_write_register(ICM20648_REG_FIFO_EN_2, ICM20648_BITS_GYRO_FIFO_EN);

  /* Reset the FIFO */
  sl_icm20648_write_register(ICM20648_REG_FIFO_RST, 0x0F);
  sl_icm20648_write_register(ICM20648_REG_FIFO_RST, 0x00);

  /* Enable the FIFO */
  sl_icm20648_write_register(ICM20648_REG_USER_CTRL, ICM20648_BIT_FIFO_EN);

  /* The max FIFO size is 4096 bytes, one set of measurements takes 12 bytes */
  /* (3 axes, 2 sensors, 2 bytes each value ) 340 samples use 4080 bytes of FIFO */
  /* Loop until at least 4080 samples gathered */
  fifoCount = 0;
  while ( fifoCount < 4080 ) {
    sl_sleeptimer_delay_millisecond(5);

    /* Read FIFO sample count */
    sl_icm20648_read_register(ICM20648_REG_FIFO_COUNT_H, 2, &data[0]);

    /* Convert to a 16 bit value */
    fifoCount = ( (uint16_t) (data[0] << 8) | data[1]);
  }

  /* Disable accelerometer and gyro to store the data in FIFO */
  sl_icm20648_write_register(ICM20648_REG_FIFO_EN_2, 0x00);

  /* Read FIFO sample count */
  sl_icm20648_read_register(ICM20648_REG_FIFO_COUNT_H, 2, &data[0]);

  /* Convert to a 16 bit value */
  fifoCount = ( (uint16_t) (data[0] << 8) | data[1]);

  /* Calculate the number of data sets (3 axis of accel an gyro, two bytes each = 12 bytes) */
  packetCount = fifoCount / 12;

  /* Retrieve the data from the FIFO */
  for ( i = 0; i < packetCount; i++ ) {
    sl_icm20648_read_register(ICM20648_REG_FIFO_R_W, 12, &data[0]);
    /* Convert to 16 bit signed accel and gyro x,y and z values */
    gyroTemp[0] = ( (int16_t) (data[6] << 8) | data[7]);
    gyroTemp[1] = ( (int16_t) (data[8] << 8) | data[9]);
    gyroTemp[2] = ( (int16_t) (data[10] << 8) | data[11]);

    /* Sum the values */
    gyroBias[0] += gyroTemp[0];
    gyroBias[1] += gyroTemp[1];
    gyroBias[2] += gyroTemp[2];
  }

  /* Divide by packet count to get the average */
  gyroBias[0] /= packetCount;
  gyroBias[1] /= packetCount;
  gyroBias[2] /= packetCount;

  /* Convert the values to degrees per sec for displaying */
  gyroBiasScaled[0] = (float) gyroBias[0] * gyroRes;
  gyroBiasScaled[1] = (float) gyroBias[1] * gyroRes;
  gyroBiasScaled[2] = (float) gyroBias[2] * gyroRes;

  /* Read stored gyro trim values. After reset these values are all 0 */
  sl_icm20648_read_register(ICM20648_REG_XG_OFFS_USRH, 2, &data[0]);
  gyroBiasStored[0] = ( (int16_t) (data[0] << 8) | data[1]);

  sl_icm20648_read_register(ICM20648_REG_YG_OFFS_USRH, 2, &data[0]);
  gyroBiasStored[1] = ( (int16_t) (data[0] << 8) | data[1]);

  sl_icm20648_read_register(ICM20648_REG_ZG_OFFS_USRH, 2, &data[0]);
  gyroBiasStored[2] = ( (int16_t) (data[0] << 8) | data[1]);

  /* The gyro bias should be stored in 1000dps full scaled format. We measured in 250dps to get */
  /* the best sensitivity, so need to divide by 4 */
  /* Substract from the stored calibration value */
  gyroBiasStored[0] -= gyroBias[0] / 4;
  gyroBiasStored[1] -= gyroBias[1] / 4;
  gyroBiasStored[2] -= gyroBias[2] / 4;

  /* Split the values into two bytes */
  data[0] = (gyroBiasStored[0] >> 8) & 0xFF;
  data[1] = (gyroBiasStored[0]) & 0xFF;
  data[2] = (gyroBiasStored[1] >> 8) & 0xFF;
  data[3] = (gyroBiasStored[1]) & 0xFF;
  data[4] = (gyroBiasStored[2] >> 8) & 0xFF;
  data[5] = (gyroBiasStored[2]) & 0xFF;

  /* Write the  gyro bias values to the chip */
  sl_icm20648_write_register(ICM20648_REG_XG_OFFS_USRH, data[0]);
  sl_icm20648_write_register(ICM20648_REG_XG_OFFS_USRL, data[1]);
  sl_icm20648_write_register(ICM20648_REG_YG_OFFS_USRH, data[2]);
  sl_icm20648_write_register(ICM20648_REG_YG_OFFS_USRL, data[3]);
  sl_icm20648_write_register(ICM20648_REG_ZG_OFFS_USRH, data[4]);
  sl_icm20648_write_register(ICM20648_REG_ZG_OFFS_USRL, data[5]);

  /* Turn off FIFO */
  sl_icm20648_write_register(ICM20648_REG_USER_CTRL, 0x00);

